

"Checking" = "檢查中...";

"No updates found" = "恭喜！您當前的版本已經是最新";

"Update checking error" = "檢查出錯，請稍後重試。";

"Feedback" = "用戶反饋";

"Check for update" = "檢查新版本";

"Version" = "版本";

"New Version Found" = "發現新版本: ";

"Skip" = "跳過";

"Ignore" = "忽略";

"Update now" = "立即更新";

"About" = "關于";

"Return" = "返回";

"Current Location" = "當前位置";

"Target Location" = "穿越位置";

"Exploring On..." = "您正在穿越中...";

"Exploring Off..." = "已退出穿越...";

"Longitude" = "經度";

"Latitude" = "緯度";

"You must choose a location before traveling" = "請先選擇穿越位置(長按地圖)，再開始穿越";

"Notice" = "提醒";

"Ok" = "好";

"Done" = "完成";

"Location service unvailable, check your settings please." = "定位失敗，請檢查您的設備。";

"Location service unvailable, traveling fails" = "當前位置無法確定，啓動穿越失敗";

"Favorites" = "收藏";

"No favorites yet" = "暫無收藏地址";

"No geo info yet" = "暫無地址描述信息";

"You can collect locations not more than %d" = "收藏失敗。您最多收藏%d個地址";

"Record is in favorites already" = "不能重複收藏";

"Favorites" = "收藏";
"The Hot" = "熱門";
"POIs" = "穿越點";
"Setting" = "設置";
"User Feedback" = "用戶反饋";
"User Instructions" = "使用說明";
"My Points" = "我的能量點";
"Acuire Points" = "獲取能量點";
"Points" = "能量點";
"Points Instruction" = "很多好心人反映，下載了應用卻沒有獲得能量點。原因是能量點獲取的條件比較嚴格，例如有些需要在下載後打開試用分鍾、有些需要注冊、有些遊戲需要創建角色。當然，條件越多的任務，賺取的能量點也就越多啦。不過，如果沒按要求完成任務的話，將無法賺取到能量點。所以，在賺取能量點前，請一定一定要查看一下該任務的具體要求哦:)";
"I know" = "知道了";

"This travel needs %d points, please acuire more points" = "穿越到此地需要消耗%d個能量點，請先補給。";

"This travel consumes %d points" = "消耗%d個能量點";
"Acquire now" = "立即補給";
"Later" = "不了";
"meter(s)" = "m";
"km(s)" = "km";
"Unknown" = "未知";
